# Задание-1
# Взять любую последовательность символов Юникода
# Написать функцию, которая принимает строку
# которая состоит только из английских букв и цифр
# и возвращает закодированное этой последовательностью
# что-то

# и написать обратную функцию, которая закодированную строку декодирует


# Задание-2
# Написать функции для создания тегов html
# Итогом должен быть набор функций, которые оборачивают текст в теги


# @a
# @div
# @p
# @set_text("Hello")
# def data():
#      return ""

# data() => <a><div><p>Hello</p></div></a>